#### Plan Output:
<details>

```bash
module.lambda-slack.null_resource.install_python_dependencies: Refreshing state... [id=2234632275049077406]
module.lambda.null_resource.install_python_dependencies: Refreshing state... [id=4500748976109089094]
module.lambda-accounts.null_resource.install_python_dependencies: Refreshing state... [id=5737878118351009928]
module.lambda-scan.null_resource.install_python_dependencies: Refreshing state... [id=5836407835178232396]
module.step-function-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-state-dev]
module.accounts-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-accounts-dev]
module.lambda-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-lambda-dev]
module.kms.aws_kms_key.encryption: Refreshing state... [id=aa68da89-d5b6-4754-a875-91b34d310d66]
module.kms.aws_kms_alias.encryption: Refreshing state... [id=alias/domain-protect-dev]
module.dynamodb.aws_dynamodb_table.vulnerable_domains: Refreshing state... [id=DomainProtectVulnerableDomainsDev]
module.sns.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dev]
module.sns-dead-letter-queue.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dlq-dev]
module.step-function-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-state-dev:domain-protect-state-dev]
module.step-function.aws_cloudwatch_log_group.log_group_for_sfn: Refreshing state... [id=/aws/vendedlogs/states/domain-protect-scan-dev]
module.lambda-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-lambda-dev:domain-protect-lambda-dev]
module.lambda-slack.aws_lambda_function.lambda[0]: Refreshing state... [id=domain-protect-slack-monitoring_poc-dev]
module.lambda.aws_lambda_function.lambda["update"]: Refreshing state... [id=domain-protect-update-dev]
module.lambda-scan.aws_lambda_function.lambda["scan"]: Refreshing state... [id=domain-protect-scan-dev]
module.lambda.aws_lambda_function.lambda["current"]: Refreshing state... [id=domain-protect-current-dev]
module.step-function.aws_sfn_state_machine.state_machine: Refreshing state... [id=arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev]
module.lambda-scan.aws_lambda_alias.lambda["scan"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-scan-dev:domain-protect-scan-dev]
module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["current"]: Refreshing state... [id=domain-protect-current-dev]
module.lambda.aws_lambda_alias.lambda["current"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-current-dev:domain-protect-current-dev]
module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["update"]: Refreshing state... [id=domain-protect-update-dev]
module.lambda.aws_lambda_alias.lambda["update"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-update-dev:domain-protect-update-dev]
module.lambda-slack.aws_lambda_permission.sns[0]: Refreshing state... [id=AllowExecutionFromSNS]
module.lambda-slack.aws_lambda_alias.lambda[0]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring_poc-dev:domain-protect-slack-monitoring_poc-dev]
module.lambda-slack.aws_sns_topic_subscription.lambda_subscription[0]: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dev:ed2692a5-3ad2-44df-ae80-042ff5fd3472]
module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["update"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["current"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["current"]: Refreshing state... [id=domain-protect-current-dev-lambda]
module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["update"]: Refreshing state... [id=domain-protect-update-dev-lambda]
module.accounts-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-accounts-dev:domain-protect-accounts-dev]
module.lambda-accounts.aws_lambda_function.lambda["accounts"]: Refreshing state... [id=domain-protect-accounts-dev]
module.lambda-accounts.aws_lambda_alias.lambda["accounts"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-accounts-dev:domain-protect-accounts-dev]
module.accounts-event.aws_cloudwatch_event_rule.scheduled_event["accounts"]: Refreshing state... [id=domain-protect-accounts-dev]
module.accounts-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["accounts"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.accounts-event.aws_cloudwatch_event_target.scheduled_event["accounts"]: Refreshing state... [id=domain-protect-accounts-dev-lambda]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda.aws_lambda_function.lambda["current"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-current-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              - "EXTERNAL_ID"              = ""
              - "IP_TIME_LIMIT"            = "48"
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.lambda["update"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-update-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              - "EXTERNAL_ID"              = ""
              - "IP_TIME_LIMIT"            = "48"
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-accounts.aws_lambda_function.lambda["accounts"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-accounts-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "EXTERNAL_ID"              = ""
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "STATE_MACHINE_ARN"        = "arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-scan.aws_lambda_function.lambda["scan"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-scan-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "BUGCROWD"                 = "disabled"
              - "BUGCROWD_API_KEY"         = ""
              - "BUGCROWD_EMAIL"           = ""
              - "BUGCROWD_STATE"           = "unresolved"
              - "EXTERNAL_ID"              = ""
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PRODUCTION_WORKSPACE"     = "prd"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-slack.aws_lambda_function.lambda[0] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-slack-monitoring_poc-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "PROJECT"           = "domain-protect"
              - "SLACK_CHANNEL"     = "monitoring_poc"
              - "SLACK_EMOJI"       = ":warning:"
              - "SLACK_FIX_EMOJI"   = ":white_check_mark:"
              - "SLACK_NEW_EMOJI"   = ":octagonal_sign:"
              - "SLACK_USERNAME"    = "Domain Protect"
              - "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.step-function.aws_cloudwatch_log_group.log_group_for_sfn has changed
  ~ resource "aws_cloudwatch_log_group" "log_group_for_sfn" {
        id                = "/aws/vendedlogs/states/domain-protect-scan-dev"
        name              = "/aws/vendedlogs/states/domain-protect-scan-dev"
      ~ retention_in_days = 90 -> 14
        tags              = {}
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.archive_file.lambda_zip["current"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "8209cab158e76eb21502f011233efb1b54145728" -> (known after apply)
      ~ output_base64sha256 = "ytEwziyAkqmDhDAiYza9gKwlN5ovIYUdjPQKpD53RT8=" -> (known after apply)
      ~ output_md5          = "ccfca34f0b5df6a82be1b7c4cabc63df" -> (known after apply)
      ~ output_sha          = "8209cab158e76eb21502f011233efb1b54145728" -> (known after apply)
      ~ output_size         = 2423631 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda.data.archive_file.lambda_zip["update"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "bd6ccfa4eac716fface25f45bd841c8bd04ef17b" -> (known after apply)
      ~ output_base64sha256 = "BLntc8zJa7faF/oanqeKvlTn+WEu6u+K792PIkxNDiI=" -> (known after apply)
      ~ output_md5          = "831c27ca82ace2188c77dba251c7fd01" -> (known after apply)
      ~ output_sha          = "bd6ccfa4eac716fface25f45bd841c8bd04ef17b" -> (known after apply)
      ~ output_size         = 4830723 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.lambda["current"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-current-dev"
      ~ last_modified                  = "2022-05-02T12:45:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-current-dev:2" -> (known after apply)
      ~ source_code_hash               = "ytEwziyAkqmDhDAiYza9gKwlN5ovIYUdjPQKpD53RT8=" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              + "EXTERNAL_ID"              = ""
              + "IP_TIME_LIMIT"            = "48"
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.lambda["update"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-update-dev"
      ~ last_modified                  = "2022-05-02T12:45:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-update-dev:2" -> (known after apply)
      ~ source_code_hash               = "BLntc8zJa7faF/oanqeKvlTn+WEu6u+K792PIkxNDiI=" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              + "EXTERNAL_ID"              = ""
              + "IP_TIME_LIMIT"            = "48"
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4500748976109089094" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-02T12:45:03Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-accounts.data.archive_file.lambda_zip["accounts"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "02493eda9f53846d9aff09c36f98273078bc6630" -> (known after apply)
      ~ output_base64sha256 = "IY9mWeevR2FnNxrCktvYrMvD6sPs6DXzRD26fKouxZs=" -> (known after apply)
      ~ output_md5          = "2e6c52dddb7c919f4ec6694dde84c7b4" -> (known after apply)
      ~ output_sha          = "02493eda9f53846d9aff09c36f98273078bc6630" -> (known after apply)
      ~ output_size         = 2423571 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-accounts.aws_lambda_function.lambda["accounts"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-accounts-dev"
      ~ last_modified                  = "2022-05-02T12:45:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-accounts-dev:2" -> (known after apply)
      ~ source_code_hash               = "IY9mWeevR2FnNxrCktvYrMvD6sPs6DXzRD26fKouxZs=" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "EXTERNAL_ID"              = ""
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "STATE_MACHINE_ARN"        = "arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-accounts.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5737878118351009928" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-02T12:45:03Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-scan.data.archive_file.lambda_zip["scan"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "8d23ce5263fb55a59ff872dabdf28abc94fe4231" -> (known after apply)
      ~ output_base64sha256 = "2T42K/UoTVXcFvzVHatCp/KEwxZVHDAKsB1WltQnMcI=" -> (known after apply)
      ~ output_md5          = "804e04e5924d9b1a67398fc6dffc9232" -> (known after apply)
      ~ output_sha          = "8d23ce5263fb55a59ff872dabdf28abc94fe4231" -> (known after apply)
      ~ output_size         = 4831233 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-scan.aws_lambda_function.lambda["scan"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-scan-dev"
      ~ last_modified                  = "2022-05-02T12:45:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-scan-dev:2" -> (known after apply)
      ~ source_code_hash               = "2T42K/UoTVXcFvzVHatCp/KEwxZVHDAKsB1WltQnMcI=" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "BUGCROWD"                 = "disabled"
              + "BUGCROWD_API_KEY"         = ""
              + "BUGCROWD_EMAIL"           = ""
              + "BUGCROWD_STATE"           = "unresolved"
              + "EXTERNAL_ID"              = ""
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PRODUCTION_WORKSPACE"     = "prd"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-scan.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5836407835178232396" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-02T12:45:03Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-slack.data.archive_file.lambda_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "7f80b1059ec4a840b4be05c5ae4d05fe8f2e535b" -> (known after apply)
      ~ output_base64sha256 = "6eN0sKda8CnmADjobvP0h8bhLfFTMqUUJrR1nDWNu9Q=" -> (known after apply)
      ~ output_md5          = "16398fea6eb354151693a7f23a78b2f6" -> (known after apply)
      ~ output_sha          = "7f80b1059ec4a840b4be05c5ae4d05fe8f2e535b" -> (known after apply)
      ~ output_size         = 4514243 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-slack.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-slack-monitoring_poc-dev"
      ~ last_modified                  = "2022-05-02T12:45:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring_poc-dev:2" -> (known after apply)
      ~ source_code_hash               = "6eN0sKda8CnmADjobvP0h8bhLfFTMqUUJrR1nDWNu9Q=" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "PROJECT"           = "domain-protect"
              + "SLACK_CHANNEL"     = "monitoring_poc"
              + "SLACK_EMOJI"       = ":warning:"
              + "SLACK_FIX_EMOJI"   = ":white_check_mark:"
              + "SLACK_NEW_EMOJI"   = ":octagonal_sign:"
              + "SLACK_USERNAME"    = "Domain Protect"
              + "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-slack.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2234632275049077406" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-02T12:45:03Z"
        } -> (known after apply) # forces replacement
    }

  # module.step-function.aws_cloudwatch_log_group.log_group_for_sfn will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_group_for_sfn" {
        id                = "/aws/vendedlogs/states/domain-protect-scan-dev"
        name              = "/aws/vendedlogs/states/domain-protect-scan-dev"
      ~ retention_in_days = 14 -> 90
        tags              = {}
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
